#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<stdlib.h>
#include<stdbool.h>
#include<time.h>
#include<math.h>
#include<ctype.h>
#include<string.h>
#include<errno.h>

/*

day02------------------------------------------------------------------------------------------------------------------------------------------------------------
预处理----》编译----》汇编----》链接----》运行

在运行这个阶段：
			把生成的可执行文件从硬盘加载到内存。
			操作系统分配资源。
			交给cpu执行。

虚拟内存：

程序的调试（debug）：

printf和scanf函数的使用：



day03------------------------------------------------------------------------------------------------------------------------------------------------------------
	scanf();
	一个空格可以匹配多个空格和回车键，也可以忽视空格。

	基本数据类型：
	有符号和无符号数比较，编译器会把有符号数认为是无符号数。
	一般不推荐使用无符号数。

	int num1=065;		是一个八进制的数字。		%o
	int num2=0xa1;	是一个十六进制的数字。	%x
	int num3=100;		是一个十进制的数字。		%d

	浮点数：使用科学计数法存储。float的范围要比long long大得多。
	浮点数并不是绝对精确的。

	字符型：
	乱码的本质：编解码的方式不一致。
	vs是用UTF-8进行编码，终端使用GBK进行解码。这样就会出现乱码。


	位运算符：
		1：移位运算：
			<<:左移运算符。
			>>:右移运算符。
			&：按位与。
			|：按位或。
			^：按位异或。
					异或（^）性质（a ^ a = 0，a ^ 0 = a）

		2：

		3：


//题目三：给定一个不为0的整数，编写函数找出它值为1的最低有效位(称之为Last Set Bit)。LSB是1表示此整数的最低位就是1, 2则表示倒数第二位是第一个1, 4表示倒数第三位是第一个1....
int find_LSB(int num) {
	 return num & -num;	// 核心技巧！取负数的补码，与自身相与
}

//题目四：给定两个不同的整数 a 和 b，请交换它们两个的值。（不要定义函数来实现，直接在main函数里实现）
int a = 0, b = 0;
printf("请输入两个值：");
scanf("%d %d", &a, &b);
a = a ^ b;
b = a ^ b;
a = a ^ b;

day04------------------------------------------------------------------------------------------------------------------------------------------------------------

scanf("%d %d")		匹配问题			模式匹配

对于多层循环，想要跳出一部分循环，可以使用标志，flag。

类型转换：
	1：类型转换分为：隐式类型转换，强制类型转换。
	char < 整形 < float < double		浮点数是用科学计数法存放的，可以表示的范围更大，但是精度低，表示不准确。
	int类型及以下的等级进行计算时，一律按照int类型计算。（如：ch1+ch2，结果占4个字节。ch+short,结果是4字节。）
	对于int类型以上的类型，运算结果是加法运算中，最大的类型。（例如：int1+long long1，结果是8字节。float1+long long1,结果是4字节，因为float表示的范围更大。）

类型别名：给类型去另外一个名字。
	typedef 原有类型名 别名；
	例如：
		typedef int datatype;
	使用typedef，可以创建别名。
	..._t：是一个类型别名，这个类型别名是跟应用系统的位数相关的一个无符号整数。
	int8_t;
	int16_t;
	int32_t;
	uint32_t;
	size_t;与环境和编译器相关，

布尔值：需要引入一个头文件#include<stdbool.h>

编码，解码。

优先级和结合性：
	后缀++优先级更高，*p++先进行++操作，再进行解引用操作。
	*p++：先进行++，再返回p的旧指向，再解引用旧p。

数组：随机存储。

day05------------------------------------------------------------------------------------------------------------------------------------------------------------

数组的随机访问：我想访问数组中的某个元素的时候，我可以通过计算直接访问到该元素，不需要遍历，直接通过变量去访问该元素。
			数组是一块连续的空间，里面所有的数据类型是一样的，所以导致了它有随机访问的特性。
			如果想访问 index=n 个数据，是可以根据地址计算公式计算该数据的地址。

数组的空间申请下来的，但是里面的数据还没有确定。
里面是随机值。
int arr1[5];			里面的数据时随机值。

数组的初始化：完整初始化，部分初始化，全值为零初始化。
数组的初始化，使用大括号初始化，只能是在初始化的时候使用。
完整初始化：

部分初始化：
		arr[10]={10,11,12};			前面三个已经初始化了，后面的没有初始化，默认为0。

全值为零初始化。
		arr[10]={0};

关于数组的长度：
		len=sizeof(arr)/sizeof(arr[0]);
另外，可以写成一个宏。
				#define ARR_LEN(arr) ((sizeof(arr))/(sizeof(arr[0])))							重要！！！

关于指针：*p++
	编译器执行*p++的时候，按以下顺序工作：
		1：取回原值：先取回p的当前值（也就是当前指向的地址A）。
		2：指针自增：执行p++，让p指向下一个元素。这一步的副作用会在表达式结束后生效。
		3：解引用原值：对第一步取回的旧地址A进行解引用*，拿出该地址里面的数据。

		char src[] = "abc";
		char dest[10];
		char *s = src;
		char *d = dest;

		while (*d++ = *s++);  // 神级写法！

		// 拆解：先把 *s 赋给 *d，然后 s++，d++。
		// 因为字符串以 '\0' 结尾，当赋值完 '\0' 后，while(0) 结束。
		printf("%s", dest); // 输出 "abc"

		写法			含义							效果
		*p++			指针自增，解引用旧值			拿旧数据，然后 p 移动到下一位
		(*p)++			值自增，指针不动				把 p 指向的数据加 1
		*++p			先自增，再解引用新值			p 先移动到下一位，再拿新位置的数据


二维数组：
		一维数组是装数据的数组。这里面装的是一个一个int类型的数据。
		二维数组里面的一个元素，我们可以认为是装一维数组的数组。
二维数组的内存也是连续的，也有随机访问的特性。
	int arr[5][6]=
	{{1,2,3,4,5,6},
	 {7,8,9,0},
	 {},
	 {},
	 {},}

const关键字：
	const int a=10
	//虽然加了const。我们无法通过 赋值的方式修改它。
	//但是，我么可以通过其他方式修改。
	可以通过scanf修改。可以通过数组越界修改。

随机数：
	 随机数的生成：
				步骤一：引入头文件，stdlib.h     time.h
				步骤二：使用一个函数，     srand()函数，用于设置种子值。		srand(1);
				步骤三：使用rand()函数，获取随机数					         int vall=rand();
						这是一个伪随机数。这个随机数只和给定的种子相关。种子值不变，随机数每次都一样。
						所以种子需要变化。时间是一个慢慢在动的值。
						时间戳：从当前时间到格林威治时间（1970-1-1 00：00：00）之间的差值。
						在time.h文件中，函数time（NULL）可以获取这个时间戳。
				所以，完整的随机数是：
								#include<stdlib.h>
								#include<time.h>

								srand(time(NULL));
								int vall=rand();
				注意：不要循环设置种子值，如果循环设置，会导致，数子变成了固定的东西。
					例如：不要使用，以下的例子。
						for(int i=0;i<100;i++)
						{
							srand(time(NULL));					//不要循环使用。

							int val=rand();					//rand()返回的随机数的范围是[0--32767]。
							printf("----------------%d\n"，val);
						}
					rand函数返回的随机数的范围[0---32767];
					如果想使用更大的范围，可以使用其他的函数库。

函数：
	分类：库函数，自定义函数。
	一个特殊的退出函数，exit。		该函数在<stdlib.h>文件中。
	我们之前退出一个程序，只能使用return，而且是只能在main（）函数中使用。
	exit(1);		程序见到该函数，就直接结束进程。
	exit(EXIT_SUCCESS);			EXIT_SUCCESS			是一个宏定义，表示0，正常退出。
	exit(EXIT_FAILURE);			EXIT_FAILURE			是一个宏定义，表示1，异常退出。

什么是栈，什么是队列？
栈是一个操作受限的线性表。只允许从一端进，从同一端出。
导致他的数据，是先进后出的。

1：写代码注意可读性。	可以帮助我们后期维护，处理bug会容易。		*****
2：注意运行效率。		不要使劲套循环，

day06------------------------------------------------------------------------------------------------------------------------------------------------------------

什么是栈？
是一个操作受限的线性表。只允许从一端进，从同一端出。数据先进后出。

函数调用：
	1：函数调用是要付出代价的。函数调用，要创建栈帧，并且压栈。
	2：处于栈顶栈帧的局部变量是有效的。
	3：函数调用结束，出栈。

局部变量未初始化，是一个随机值。

全局变量：
		局部变量是在{}内部，全局变量是在{}外部。
		全局变量默认值为零值，不初始化也是零值。
全局变量在什么地方可以用：在定义位置及以下位置可以用。
全局变量也可以在当前位置以以下位置使用，而且在其他的.c文件中也可以使用。
例如：
	在main文件中，定义一个全局变量	int global_num1=0;
	在其他文件中：	extern int global_num1;
	在实际的工作中，使用全局变量的机会很少。
	因为，实际工作中，会有很多.c文件，大家都能改，容易出错。
static 修饰的全局变量。它的使用范围，就缩小到了当前的.c文件。
全局变量是存储在数据段的。

static:静态局部变量，仅在首次调用时初始化，再次调用则不会继续初始化。
	static int count=0;	只执行一次。后续，无论调用多少次，都不会初始化。

注意：在使用全局变量的时候，把全局变量传进函数的时候，一定要避免形参和全局变量重名。
		因为，在C语言中，函数的形参具有最高的优先级，所以在函数内部修改的是形参。
		例如：
			int global_variable =0;
			void modify_global(int global_variable) {
				global = 100;
			}
			这是错误的，函数内部并不会修改全局变量global_variable的值。

day08------------------------------------------------------------------------------------------------------------------------------------------------------------
转换说明中的特殊符号：“*”
		int width=5;
		int point=2;
		double a=3.1415;
		printf("|%*.*f|",width,point,a);							//最终将输出：| 3.14|
		但是，这里不要和scanf()里面的“*”搞混。
printf()函数的返回值是一个int类型的数字。
	例如：
		int ret=printf("hello\n");
		printf("ret = %d\n",ret);									//正常输出了6个字符，所以返回值是6。

		int ret2=printf("");
		printf("ret2 = %d\n",ret2);									//正常输出0个字符，所以返回值是0。

		当输出成功的时候，返回值表示实际输出的字符总数（不包含末尾的空字符）。即成功输出时，返回值是一个非负数，最小也是0。
		如果因为某些原因失败，那么返回值将会是一个负数。

  函数的值传递：
		讲的是在函数调用过程中，对参数的处理。
		在函数内部可以使用这个参数。

函数递归：
		递归：函数自己调用自己。
		递归有一个最核心的两个问题：递归出口，递归过程。

		递归问题：
			递归代码的好处：
							1：简单。
			递归代码的缺点：
							1：因为递归是自己调用自己，是使用函数的栈来存储调用过程。
								一代调用层级过深，就会出现栈满。
							2：对于有一些过程，细节不好理解。
							3：会存在重复计算问题。

虚拟内存：从0开始的最大的内存。
		 虚拟内存是一个虚拟的内存，我们认为程序中得到的内存，都是虚拟内存，我们拿到的内存都是连续的，从0开始的。
		 如果直接使用物理内存，进程隔离过于困难。内存碎片化，非常麻烦。

变量地址：一个变量是有地址的，比如一个int类型，占用4个字节的位置，但存储他的地址是，存储的首地址，即1个字节。
		变量的首字节地址。

大端：数据高位在地址低位，数据低位在地址高位。		大端存储是给人看的。
小端：数据高位在地址高位，数据低位在地址低位。		小段存储是给计算机看的。

指针变量：指针就是地址。地址就是指针。
		指针声明后，应该初始化。						int *p=NULL;

		初始化的三种方式：
			方式一：使用&得到地址。
			方式二：使用NULL来初始化。NULL是一个值为0的重定义。
			方式三：使用其他指针赋值。

空指针：	如果你最初不知道，这个指针指向哪里，就让他指向NULL，等到后面，知道指谁了，再换指向。
		如果一个指针被赋值为NULL，那么，这个指针被称为空指针。
		空指针的作用：就是明确这个指针不可用，执行一块明确不可用的地址。

		如果使用空指针，系统会崩溃。不可读，不可写。
			例如：
				int *p=NULL;			//这时候是不可写，不可读的状态。
									//使用之前先确认一下，是不是NULL。如果是空指针，就不要去解引用，不去赋值。

		NULL的是一个宏定义：		#define NULL ((void *)0)
		实际上，NULL就是指的地址的0位。即0x00000000。
NULL和nullptr的区别：
		NULL：本质上是一个宏，在C++中，他通常会被定义为整数常量。本质上，他是一个int类型。
		nullptr：是一个关键字，他是一个“空指针类型”，只能用来初始化指针，不能用来做数学计算。

野指针：
		指针定义了，但是没有初始化。

二级指针：
		int num1=10;
		int num2=20;

		int *p1=&num;

		int **pp1=&p1;

		*pp1=&num2;
		**pp1=999;

指针和数组：
		数组名是数组的首地址。
		有两种情况，不能当作首指针对待。
			1：sizeof()的时候，数组名，得到数组占用的空间大小。
			2：&arr的时候，&arr的作用的arr是相同的。

数组在传参的过程中，要传入两个参数：数组名，数组长度。
			void test1(int arr[],int len);						//可以写成数组的形式。在函数传参的时候，会被视为指针。
			void test2(int *arr,int len);						//这两种写法完全等价。
	int[]  ---->  退化为指针。int *

day09------------------------------------------------------------------------------------------------------------------------------------------------------------
1：什么是虚拟内存？
	从0到最大的连续的内存。
	直接使用物理内存，进程间隔过于困难。
	内存碎片问题不好解决。
	程序员使用内存麻烦。
2：虚拟内存上的，地址是什么东西，是干什么的？		（内存地址，变量地址）
	虚拟内存地址，就是虚拟空间上，一个位置的唯一性标识。单位是一个一个字节来的。
	地址就是内存的编号。
3：什么是小段存储？
4：指针是什么？指针变量是什么东西？
	指针就是地址。
	指针变量就是用来存储地址的变量。
	int num=10;
	int *p_num=&num;
	int **pp_num=&p_num;

 一维数组的数组名：是一个指向数组首元素的指针。
 数组名：其实是数组元素类型的指针。

 二维数组：装 一维数组 的数组。（数组的角度）
		  是一个数组指针（int[5] *）。（指针角度）
		  int[5] *:这种指针的偏移量不一样。一次偏一行。

数组指针：
		数组指针本质上是一个指针。这个指针在偏移的时候，一次会偏移数组大小个空间。
		int (*arr_p)[5];				首先确定是一个指针，然后再和[]进行结合。		arr_p是一个数组，里面有 5 个元素，每个元素都是 int*（指向 int 的指针）。

		int arr[3][5];			//二维数组：3行，每行5个int。
		int (*p)[5]=&arr;			//p指向arr的第一行。即指向&arr[0]。
		此时，p加1（p+1），会跳过一整行，因为指向一行5个元素的int。

指针数组：
		指针数组就是数组，这个数组里面存储的都是指针。
		int *p_arr[5];				首先确定是一个数组，然后数组里面存放的是int *类型的变量。		p是一个指针，它指向一个包含 5 个 int 元素的数组。
*和[]的优先级：[]的优先级更高。

指针常量：

常量指针：

看const右边的内容，const右边修饰谁，谁不能操作。

指针作为函数的返回值。
		不能返回函数内的普通局部变量的地址，因为函数结束，普通局部变量销毁。

字符串：
		在C语言中，字符串就是字符串数组。不过强制性要求 以\0为结尾。所以字符串中无法存储空字符('\0')。
		'\0'是什么东西？		表示空字符，ASCII码的码值为0。
		char ch1='0';				是字符0，ASCII码的码值为48。
		char ch2=' ';				是空格字符，ASCII码的码值为32。
		char ch3=0;				是ASCII码值为0。是空字符。
		char ch4='\0';			是ASCII码值为0。是空字符。

		0和'\0'是等价的，都表示空字符，ASCII码的码值为0。

scanf()的安全问题：如果scanf给的空间不够用，这时候他会使劲写。他不管空间够不够。
		char str[10]="1234567890";				这时候str是字符数组，后面没有'\0'。
		scanf("%9s",str);						这时候无论输入再多，都只接受9个字符，最后一个字符为'\0'，这样就是字符串了。
											剩下多余的就直接在缓存区留着。

字符串函数：
		strlen()：一定要给一个字符串，一定要以'\0'结尾。如果不以'\0'结尾，会出现数组越界的访问。
				 给的数字是\0之前的字符个数。不包含\0。
				 strlen()里面是放的数组名，本质是指针/地址。		strlen()：    全称为   size_t strlen(const char *str)
				 本质上是计算从你给的地址往后，到最近的\0之间的距离。
		strcpy()：将一个字符串，拷贝到另一个字符串中。
				 使用时一定要保证dest能够装，如果dest长度不够，系统会硬塞数据进去，造成数组越界。这个函数不关心dest够不够装。
				 char *strcpy(char *dest,const char *src);
			strncpy()：使用时，提供一个长度信息。		该函数拷贝的时候，不拷贝\0。
					  如果拷贝的count大于src，那么会拷贝\0过去。
					  这里的count建议：sizeof(dest)-1。
					  char *strncpy(char *dest,const char *src,size_t count);
		strcat()：完成字符串的拼接。将src表示的字符串，拼接到dest的后面。也就是从dest的\0位置开始覆盖，直到结束。
			strncat()：更安全的拼接函数。
					  有两种结束条件：
								1：src到了末尾的\0。
								2：到了n也会结束。
					  建议	n=sizeof(dest)-strlen(dest)-1;
		strcmp()：比较两个字符串是否相等。
				 按照字典序进行比较大小。遇到不相等的，就看谁的字典序大，也就是谁的ASCII码值大。
				 会返回-1，0，+1。

		sizeof()：计算一个类型/一个变量占据的空间大小。
		strlen()：算字符串的长度。'\0'前有多少。
				char str[10]="12345";
				char *p=str;
				sizeof(p);			4/8			占4/8个字节。
				strlen(p);			5			指针指向的字符串的长度。

字符串数组：
			两种存储方式：1：二维字符串数组。
						 2：指针数组。（重要）

命令行参数：
		int main(int argc,char *argv[])
		{
			系统会运行main函数。想给参数到函数内部，就会给到main函数。
			如果想在main函数中接受参数，格式是固定的。
			参数一共有两个。并且第一个类型是int，第二个类型是char类型的指针数组。

			argc：参数的个数。
			argv：参数的具体值。

			即使你一个参数也不写，也有一个，是程序的名字。

			return 0;
		}

sprintf()：可以组装字符串。
		printf()：向屏幕输出。
		sprintf()：向字符串输出。
				int num=10;
				float f1=10.8f;
				printf("%d-----------%f",num,f1);				向屏幕输出。
				char str[100]="56790y8bkigjdgfdgd";
				fprintf(str,"%d-----------%f",num,f1);
		例如：输出test1，test2，test3......test1000
			for(int i=1;i<=1000;i++)
			{
				sprintf(str,"test%d",i);
			}
sscanf()：从字符串做输入。
		char *p="10 20";
		int num1=0;
		int num2=0;
		sscanf(p,"%d %d",&num1,&num2);

int main()
//{
//	//辨析：一维数组     arr1    &arr1
//	//	   二维数组	   arr2	  &arr2		**p
//
//	//有两种情况数组名表示整个数组：1：sizeof（arr）
//	//							 2：&arr					//在数组名前加&，此时表示整个数组。其它情况下，都将转化为指向首地址的指针。
//
//	//一维数组。
//	int arr1[3] = { 0 };
//
//	int (*p1)[] = &arr1;
//	//&arr1：int (*)[3]，本质上是一个数组指针。是一个行指针。指向长度为3的int型数组。		它和int *完全不同，&arr1+1会跳过整个数组（12个字节。）。
//
//	int *p2 = arr1;
//	//arr1：本质上是一个数组，在大多数情况下，他退化为int *。
//	//p2是一个int *，是一个指针。
//
//	//二维数组。
//	int arr2[3][4] = { 0 };
//
//	int (*p3)[] = arr2;
//	//arr2：int[3][4]，本质是一个二维数组，在这里退化为一个数组指针（行指针），即int (*)[4]。
//	//p3：int(*)[4]，这里的arr2退化成了int(*)[4]，成了一个行指针。
//
//	int (*p4)[][4] = &arr2;
//	//&arr2：int (*)[3][4]，指向整个[3][4]数组的指针。
//	//p4：int (*)[3][4]的指针，指向整个[3][4]数组的指针。
//
//	int **p5;
//	//注意：这里的二级指针**p5，和int (*p)[4]数组指针（行指针），不是一个东西。
//	// int (*p)[4]：是一个指向一块连续存放4个整数的内存块。
//	// int **p：指向一个存放着“某个整数指针”的内存位置。是指向指针的指针。
//
//
//	//对于数组来说：
//	//			数组名（不加&）--arr：表示指针，一维数组是一个指向首元素的指针，二维数组是一个指向首行的行指针（数组指针）。
//	//			&数组名（加&）--&arr：表示指向整个数组的指针。一维数组是一个行指针，二维数组是一个指向[m][n]列的指针。
//	//								加&，就表示整个数组。
//
//
//	return 0;
//}

day10------------------------------------------------------------------------------------------------------------------------------------------------------------
结构体：自己定义数据类型，这个数据类型是由一个或多个基本数据类型组成的。
		typedef struct students			typedef换类型别名。
		{
			int id;
			char name[20];
		}Students;
	如果是部分初始化，没有初始化的部分是0。

结构体的内存对齐：
		int(4字节)：内存是放在以4为倍数的地址上。
		short(2字节)：内存是放在以2为倍数的地址上。
		double(8字节)：内存是放在以8为倍数的地址上。
		........
		以此类推。
	一般来说，小字节变量放前面，大字节变量放后面。

调用函数，传入结构体的变量的时候，结构体的内存，是整体复制一份。如果要改原件，要传指针进去。
		Student s1={10,"zhangsan",'f',90,80,70};
		Student p_s1=&s1;
		(*p_s1).stu_id=999;						这里要加(),因为.的优先级高。
		p_s1->chinese=50;							->就是解引用。

枚举：就是表示状态，全部放进一个enum里面，其实它的本质就是宏定义。
	  枚举如果没有初始化，默认从0开始递增。
		typedef enum vip_level
		{
			NORMAL,
			SVIP1,
			SVIP2,
		}Vip_Level;

指针高级：
		动态内存分配：
				栈区效率没有堆区效率高。
				栈区无法满足内存需求，再使用堆区。
						1：使用大内存的时候。
						2：编译期无法确定大小。
						3：生命周期需要够长。
				通用指针：不能解引用，也不能算数运算。只能存地址。只有强制类型转换后才能正常使用。
						 指针不仅表示地址，还表示对这块内存的使用方式。
				malloc()：void *malloc(size_t size)，里面是要申请的字节。
						返回的值有两种可能：1：NULL			申请失败。
										   2：地址			申请成功。
						申请内存的标准步骤：1：申请内存。								使用malloc。
										  2：对申请的内存进行判断。					if(p==NULL)
										  3：使用这块内存。
										  4：释放内存，指针悬空。						free();
				free()：void free(void *ptr);
						参数必须是在堆上申请地址的首字节，不能传递别的指针。否则会引发未定义。
				p是指针，如果我free(p)，他是怎么知道自己要释放多大的字节的。
					MSVC下，他将这个内存块的大小偷偷存起来了，每次free的时候，他都固定的向前找16个字节。通过这个数，来确定要释放的空间大小。
					对于不同的操作系统，free在前面存储位置也是不一样的，在当前是16，到其他操作系统下可能就不是16了。
					如果给他一个非首字节地址，那么他就找不到这个数了。会导致程序崩溃。
		二级指针：


		函数指针：










day11------------------------------------------------------------------------------------------------------------------------------------------------------------
内存泄露：只去申请内存，不去释放内存。
动态内存分配，就是使用一些函数，在堆上申请空间。		申请，判断，使用，释放和指针悬空
		申请：
			int *p=malloc(60);			申请60个字节。
		判断：
			if(p==NULL)
			{
				printf("malloc failed.\n");
				return;
			}

free函数：void free(void *ptr)
		free必须传入的是，堆上拿到的内存的地址，且必须是首地址。
		free是在释放它指向的那块空间，所以，它只能释放一次。

calloc：void* calloc(size_t num,size_t size)；		num：申请个数。size：每个多大字节。并且，直接初始化为0。在申请指针的场景会用到。
		int *p=calloc(12,sizeof(int));

realloc：重分配，系统允许你将申请的空间重新调整大小（弄大或弄小）。
		int *p=malloc(20);
		realloc(p,40);			将指针p指向的空间由20变为40。新申请的20字节内存是随机值。
		不要用p再去接受realloc返回的指针，如果申请失败p会变为NULL，那么原来的内存也会泄露。
		用一个新指针去接收这块内存。

vector：长度可变的数组。
		int arr[10];						这个是普通数组，它只能装固定长度。
		int *p=malloc(40);				10个int。
		int *new_p=realloc(p,80);			这个可以装20个int。

day12------------------------------------------------------------------------------------------------------------------------------------------------------------
头文件：将我们的代码库，拆成一个一个文件，方便管理。
		头文件中，我们主要放四类东西：
			1：结构体。
			2：类型别名。
			3：宏定义。
			4：函数声明。
		#include的时候，<>代表去系统库中去找。
					   ""代表先去自己的头文件去找，若没找到，再去系统库找。
		头文件保护：让一个头文件，只要被引入了第一次，就不会再重复被引用。
				#ifndef HEAD_H
				#define HEAD_H
				#endif

				#pragma once

函数指针：一个指针指向了函数（代码段）。
		函数返回值类型 （*函数指针名）（函数形参列表）；
				void (*fun_p)(void)；				指针变量周围的类型，都是约束。
			当函数指针做函数形参的时候。可以写*，也可以不写*。
				例如：
						int (*p)(int);
						int test(int p(int));==========int test(int (*p)(int));

		给函数指针起别名。
				typedef int (*Fun_P)(int,int)			创建一种Fun_P的数据类型，和结构体一样。
		typedef是给类型起别名的。

		函数指针的初始化：
				FuncPtr p=NULL;
				FuncPtr p=test;				函数名字就表示函数地址。（不要写小括号）
				FuncPtr p=&test;				函数名字加&和不加&都是一样的，都表示函数的地址。
											数组则不一样，数组加&，表示整个数组。
		函数指针是指向函数的，使用方法有两种，加*，不加*。
				void (*func_p)(void)=test1;
				(*func_p)();
				func_p();					这两种方式等价。都相当于调用test1函数。

选择排序：
		void select_sort()
		{
			int arr[10]={89,34,322,54,65,5,56,54,34,32};

			for(int i=0;i<sizeof(arr)/sizeof(arr[0])-1;i++)
			{
				int MIN=i;

				for(int j=i+1;j<sizeof(arr)/sizeof(arr[0]);j++)
				{
					if(arr[MIN]>arr[j])
						MIN=j;
				}

				int temp=arr[MIN];
				arr[MIN]=arr[i];
				arr[i]=temp;
			}
		}

qsort()：void qsort(void *base,size_t num,size_t size,int (*compare)(const void *,const void *))
		系统写好的一个排序算法。

链表：链表的数据是分散的，空间不是连续的。基于指针链接的节点组成。（数据+指针）
		如果想访问第100个数据，必须一个一个访问。



栈：先进后出，从一端进，只能从这一端出。
队列：先进先出，从一端进，从另一端出。

哈希表：就是数组+链表。

二叉搜索树：二叉树的实现借鉴链表的思路。

day13------------------------------------------------------------------------------------------------------------------------------------------------------------
函数指针是什么？
	指针，指针指向代码段上的函数。
线性表包括哪两种？
	数组，链表
	数组：内存空间是连续的。			随机访问：随机访问就是可以通过首地址+下标，从而计算地址，直接访问到该内存。
	链表：内存空间不连续。
数组查找速度快。插入和删除速度比较慢。因为要挪动数据。
	数组在工作过程中，用的会多一点，因为它可以充分利用cpu的缓存。
	但是，如果想找数据，那么需要一个一个找。
	如果想头删数据，那么还要把后面的数据整体往前挪动。
链表的查找速度慢。插入和删除速度稍快。

对于链表的增，删，改，查。								找前驱（*pre_node），找当前节点（*curr_node）。
删；根据索引删，要找到前驱。根据值删，也要找前驱。		需要单独处理idx=0的时候，这时候没有前驱。
		我们在删除的时候，前置准备工作是，要找到它的前驱。

简单聊一聊数组和链表。（先大后小，先聊宏观性的东西，再聊细节性的东西。）
	首先，他们都是线性表，数据都是一个一个的。
	数组的空间是连续的，链表的空间是离散的。
	对于数组，增加数据，删除数据都需要挪动数据。数组根据索引得到数据很容易。时间复杂度为o（1）.
	对于链表，增加数据，删除数据。不需要挪动数据，只需要修改指针。

链表反转：



栈和队列：
		栈：操作受限的线性表，只允许从一端进出。
				栈的实现：数组实现简单。
						数组实现：一个普通的数组，在额外加上一个int类型的变量来存储栈顶的位置。进栈的时候，将数据放进去，再将这个int类型的变量+1。
									进数据的时候，就是往top_index这个位置放数据。
						链表实现：头进头出（这中方式方便。尾进尾出出栈麻烦。）。
		队列：只允许从一端进，另一端出。
				队列的实现：链表实现简单。
						链表实现：尾进头出简单。
						数组实现：固定数组开头就是队头，然后用索引rear标记队尾下一个插入位置。

哈希表：用来存放键值对的数据。键值对数据就是键和值是一对的。哈希表目的是用来根据键找值。快速找值o（1）。
		键是唯一的。
		哈希表操作步骤：
				1：对key进行计算，得到一个int。（其实就是哈希的过程。）
				2：现在想将这个int，放到数组中，int可能会很大。所以需要使用这个int对数组长度取余。
				3：该数组位置，无数据，直接将数据存入。
					如果该位置有数据，需要比较是否相等。不相等的话，往下比较，如果比较完成了，没找到相同的，说明这个键值对需要添加到里面。

day14------------------------------------------------------------------------------------------------------------------------------------------------------------
什么是哈希表？
		哈希表是一种数据结构，存储键值对的数据。希望根据键来快速找到值。
		底层是数组+链表。		随机访问特点。
	哈希表的目的：
			希望插入速度O（1），查询速度O（1），删除速度O(1)。
	哈希表为什么效率高：
			哈希表的底层是怎样存储数据的？
			1：将key计算，转换为int整数。
			2：将计算后的int整数，对数组长度取余。
			3：如果这个位置没有数据，直接将数据存入。
			   如果该位置有数据，对该位置的数据进行遍历，看是否有键相同的数据。如果存在相同的键，则将该位置的值覆盖（更新）。
			   如果没有相同的键，将数据进行头插入。

day15------------------------------------------------------------------------------------------------------------------------------------------------------------
树：
		一个数据后面跟多个数据。他的每个节点都是有多个指针。例如有两个指针。*left,*right
			struct node_s
			{
				int data;
				struct node_s *left;
				struct node_s *right;
			}
			数据的关系是一对多，一个数据后面可以跟多个数据。二叉树，三叉树。

二叉搜索树：一个结点最多有两个孩子，就是二叉树。
			孩子的大小关系和当前结点的关系是已知的。左孩子比根节点小，右孩子比根节点大。
		前提是这棵树不歪，数据的根节点是中间值。
	红黑树：特殊的二叉搜索树，有自己的平衡策略，可以保证这棵树不歪。
	数组也可以表示二叉搜索树，第i个节点的左孩子和右孩子是2*i+1，2*i+2。
			他的前提是前i层是满的。

算法：
		算法的学习重心：
				要能用自己的话，将算法的思想讲出来。
				能够评估一个算法的时间复杂度和空间复杂度。
							时间复杂度就是花费了多少时间，关心一些操作的量级。
							空间复杂度就是，这个算法占用了多少空间。O(N),O(1)。
					时间换空间，空间换时间。
				算法的稳定性：看有没有长距离的数据移动。


		排序算法：
				基本排序：
						选择排序：每一轮将最小的/最大的，选到前面，或者先到后面。
						冒泡排序：
						插入排序：
				高级排序：
						希尔排序：
						归并排序：
						快排：
						堆排：
								大顶堆，小顶堆
								下标为i的节点的父节点为（i-1）/2，整数除法。
								下标为i的节点的左孩子为i*2+1，下标为i的节点的右孩子为i*2+2。
		归并排序，

day16------------------------------------------------------------------------------------------------------------------------------------------------------------
						归并排序：
						快排：快排的思想，就是找一个中枢，比中枢小的数据放左边，比中枢大的放右边。
						堆排：第一次建堆过程，

文件流：
		API：
				基本操作：对文件进行操作，都是以程序的角度思考问题。读文件，就是程序得到文件的数据。写文件，就是改变文件的数据。
						 路径：绝对路径，相对路径。
								相对路径：在VS中，默认是项目根文件夹。
										可以修改文件的默认根路径：对项目点击右键--》属性---》调试---》工作目录
						 文件流的标准操作：
								1：打开文件流：
								2：检查拿到的FILE是否成功。
								3：读写数据：
								4：关闭文件。
						打开模式：
								r：表示读。
								w：表示写。如果文件不存在，就创建文件。如果存在，覆盖掉原来的内容，写进去。
								a：追加写入模式。在文件中的末尾继续写入。不是覆盖。
							在这些模式的后面写入"b"，那么就是二进制方式。主要是提高兼容性。一般是在赋值图片或者视频的时候使用。
						fopen()：用于大家一个文件，第一个参数是路径，第二个参数是读写模式。返回一个结构体指针FILE *。
								FILE *fr=fopen("1.txt","r");
								FILE *fw=fopen("1.txt","w");
						fclose()：关闭文件。
								fclose(fr);
						fgetc()：从文件中一个字符一个字符的读取数据。
								int ch=fgetc(fr);
						fputc()：写数据到文件夹中。
								int ch=fputc('a',fw);
						fgets()：
								fgets(buf,100,fp),buf是一个指针名，100是数组的最大长度，fp是从这个里面读文件。
								这里的100是数组长度，只读取99个字符放到数组里面，最后一个要补'\0'。
								这个函数如果读取成功，返回buf的地址，读取失败，返回NULL。
						fputs()：
								fputs("32423423423",fp);
						fscanf()：从文件读取数据。
								scanf("%d %d %lf",&a,&b,&c);
								fscanf(fp,"%d %d %lf",&a,&b,&c);			和scanf的语法一样，只是多了一个参数，从文件输入。
						fprintf()：往文件输出数据。
								printf("========%d\n",10);
								fprintf(fp,"========%d\n",10);			和printf的语法一样，只是多了一个参数，往文件输出。
						fread()：以二进制的方式读取。在读写模式中，后面加b。

						fwrite()：以二进制的方式写入。在读写模式中，后面加b。
day17------------------------------------------------------------------------------------------------------------------------------------------------------------
路径是什么，分为哪几种？
		路径就是文件在计算机中的位置。分为相对路径，绝对路径两种。
文件流是干什么的？
		对文件进行操作的。读/写。
		流模型是一个读写模型。我们不断使用fgetc读数据，就可以一个字节一个字节的读取。
		我们在这个过程中，没有关心他的长度，没有关心有没有读完。
流模型的标准操作步骤：
		1：打开文件流。
		2：检查是否打开成功。
		3：使用文件流。
		4：关闭文件流。

文件定位：
		fseek()：
				fseek(fp,2,SEEK_SET);
				fseek(fp,0,SEEK_CUR);
				fseek(fp,0,SEEK_END);
		ftell()：返回当前文件位置指示器相对于文件开头的偏移量（字节数）。
		rewind()：将文件位置指示器重置到开头。
				等价于fseek（fp,0,SEEK_SER）;

序列化和反序列化：
		序列化：就是对数据存档，对数据进行保存。把数据从内存里面保存到硬盘里面。
		反序列化：就是读档。把数据从硬盘读取到内存里面。
错误识别：
		需要引入头文件：#include <errno.h>
		erron：
			在C语言里面，定义了一个全局变量，erroon，本质上是一个宏定义。是一个数字。
			printf("errno=%d\n", errno);
		strerron：
				将整形转化为对应的错误的字符串。
				printf("------%s\n", strerror(0));
		perror：
				会把传入的字符串打印出来，加上冒号，再接上当前errno对应的错误描述文本。
					perror("fopen 失败");
					输出：fopen 失败: No such file or directory
day17------------------------------------------------------------------------------------------------------------------------------------------------------------
	软件开发公司有几类人？
		1：项目经理：做时间管理，对一些终止时间负责。
		2：产品经理：捋功能，负责捋对应的逻辑。
		3：前端/客户端：做网页的，做客户端的。
		4：后端：做数据处理的。
		5：硬件工程师：和硬件打交道，负责让硬件给对应的数据。
		6：测试：测试应用是否正常。

day19------------------------------------------------------------------------------------------------------------------------------------------------------------
	Linux：
			凡是需要和计算机中硬件打交道，都绕不开内核。
			再Linux里面，没有消息就是最好的消息，如果输入一条命令，没有反馈说明他成功了，如果有反馈，可能是出错了。
			在shall里面，可以使用tab进行补全，会对一些没有争议的路径名补全。
			上下键可以显示上一次输入的命令。显示历史。		ctrl+r是搜索命令，之前输入过的命令，可以搜索。
day20------------------------------------------------------------------------------------------------------------------------------------------------------------
		man命令：
				sudo命令：

		Linux文件系统：
				文件是按照文件类型分类的。

		目录相关的目录：
				pwd：打印当前所在的目录位置。
				cd：改变当前目录。		cd：相对路径/绝对路径（在Linux中，以/为开头，后面接根目录）。
						cd ..：返回上一级目录。		cd .：代表当前路径。
						cd ~：回到家目录。
				mkdir：创建目录。
						只能创建单级的目录。如果要创建多级目录，要加 -p。
				ls：查看当前目录有什么。
						可以跟相对路径，也可以跟绝对路径。
						后面加 -a，可以显示当前路径的所有文件，包括隐藏文件。以.开头的是隐藏文件。
						ls -l：
						ll：以列表的形式显示，显示全部信息。
				cp：复制文件。
						例如：cp text1.tst tesxt2.txt
				rm：删除文件，删除文件夹。
						rm -r：删除文件夹。
						rm：删除文件。
						rm -rf ：直接删，没有提示。

		文件相关命令：
				touch：创建文件。

				echo "123">1.txt				覆盖输入。
				echo "123">>1.txt				追加输入。		

				vim：如果文件不存在，创建文件。
					 如果文件存在，
						按i，进行输入。
						按esc，输入：，输入wq，保存并退出。w是写入，q是退出。

				cat：显示文件内容。文件小可以用。
				tail：tail -100f 6.txt		输出最后一百行代码。			

				find /usr/include -name"stdio.h"：查找文件。在/usr/include 目录下查找stdio.h
				find .-name"*.c"					在当前工作目录下查找以.c为结尾的文件。

				grep -nE "file" stdio.h：搜索文件，在stdio.h文件里面，搜索带file的文件。
						n：表示显示行号。

				命令组合：shell命令是可以组合的。
						 mkdir test1;cd test1		创建并进入test1。
						 cmd1|cmd2				让cmd1的输出作为cmd2的输入。

				ifconfig：查看电脑ip。

				ping ：确认电脑的网络。
				ping www.baidu.com

				tree：以树状格式显示文件夹里面的文件。
		find命令详细说明：
			它能在指定目录下，根据各种条件（文件名、类型、大小、修改时间等）地毯式地查找文件。
				按名字找：
					找当前目录下叫test.txt的文件。			find . -name "test.txt"		精确匹配，区分大小写。
					找当前目录下所有.log结尾的文件。		find . -name "*.log"			*是通配符，代表任意字符。
					不管大小写，找叫Text的文件。			find . -iname "Text"			-iname中i代表ignore(忽略大小写)。
				按类型找（区分文件和文件夹）：
					只找文件夹							find . -type d				-type d中的d代表directory
					只找普通文件（不包括文件）				find . -type f				-type f中的f代表file
day21------------------------------------------------------------------------------------------------------------------------------------------------------------
				
				
				
				ln：硬链接，
						对文件：
						对文件夹：
		权限问题：
				目录权限：
					chmod 权限 1.txt		权限：rwx分别用二进制表示。但是实际上使用八进制表示的。


				文件权限：
					文件的读，写，执行权限。
						

				权限掩码：
						umask：显示默认权限
						文件默认权限：

						文件夹默认权限：

vim的模式：
		normal模式：普通模式。
		insert模式：i，I，a，A，o，O。
		visual模式：v，行选中。
		v-block模式：ctrl+v，竖选中

		vim +行号 文件：可以快速跳到文件里的这个行号。
		vim可以打开文件，可以打开文件夹。

		q！：强制退出，不提示，不保存。

		长命令：以冒号（：）开始，enter结尾的命令。
		短命令：除了长命令，就是短命令。
		在vim是区分大小写。

		vim中的命令是可以组合的。

day22------------------------------------------------------------------------------------------------------------------------------------------------------------
		预处理：gcc -E hello.c -o hello.i			.c文件变为.i文件。
		编译：gcc -S hello.c -o hello.s			.c文件变为.s文件。
		汇编：gcc -c hello.c -o hello.o			.c文件变为.o文件。
		链接过程指令：gcc test1.c test2.c -o test	将多个.c文件生成一个可执行文件。

		gcc test1.c -o test		把.c文件变成可执行程序。

		-Wall：对打印所有的警告信息。建议加上，warning，，error。
			例如：gcc test1.c -o test -Wall		如果有警告，错误的话，显示出来。
		-O0，-O1，-O2，-O3编译器优化级别：
			编译器会优化你的代码：-O0，-O1，-O2，-O3优化等级逐渐升高。
				-O0：不要进行优化，直接输出。在debug（调试）的时候会用。
				-O3：进行优化。优化过于激进，可能会有bug。
		-g：在调试的时候用，会保留一些东西（注释，变量名等）。

		实际使用时：gcc test6.c -o test -Wall -O0 -g

条件编译：
		//在日常写代码的时候，我们会打印一些东西。这些打印，对程序员自己有用，但是对客户无用。
		//上线的时候。可会希望删掉。出了问题，又可以快速找到问题。
		#ifndef	宏
		#ifdef 宏
		#if 条件（例如：1==1，1！=1）
		#endif

		#define DEBUG 1
		int main（）
		{
			#if DEBUG==1
				printf（。。。）；
			#endif

			这时候会打印。到软件上线的时候，把宏定义DEBUG改为0。
			return 0;
		}

GBK调试：
		进入GDB的方法：
				方式一：gdb 文件名。
				方式二：gdb
						文件名。
	
		正式的操作：
				list（或者l）：查看代码。一次出现10行。默认往下移动。
					l -：往上翻。
					l 文件名：行号，
				run（或者r）：启动程序，这里就是debug模式启动。
				kill（或者k）：终止调试，但是不退出GDB。
				quit（或者q）：退出gdb。
			断点：
				打断点：break（/b） 行号。			b 17：在17行打断点。
						tb：临时断点。断点只执行一次，用过后就删掉。
			查看断点：
				info break（i b）：查看断点。
				d num：删除断点。num时info break的时候看到的num。 d，删除全部断点。

				c：跳到下一个断点。

				s：一步一步执行，碰到函数就进去。碰到什么函数都进，包括库函数（例如：printf）。
				n：一步一步执行，碰到函数不进去。建议使用n。
				finsh（fin）：跳出函数。
			函数调用栈：
					bt：函数调用栈。

			int main(int argc,char *argv[]);
			argc默认为1。

		调试Coredump文件：保存程序出现意外的一些信息。
			
库文件：
		静态库：在链接阶段将.o文件复制过去。		后缀：.a  .lib
		动态库：动态库就是只存位置，使用的时候再去找。在链接阶段不会把别人的代码弄过去。		后缀：.so  .dll

		优缺点：
				静态库：优点：	1：快。						2：移植性强。
					    缺点：	1：生成可执行文件大。			2：如果库进行升级，所有依赖这个库的都需要重新链接。
				动态库：优点：	1：小。						2：对开发者和使用者友好，升级之后，使用者不需要重新链接。
					    缺点：	1：移植性不好。				2：速度稍慢一点。

Makefile：
		Makefile就是一个脚本，我们用来生成可执行程序的命令。脚本就只文本，这个文本可以直接运行。
		
		伪目标：
day23------------------------------------------------------------------------------------------------------------------------------------------------------------
文件系统编程：
		系统调用：是函数，linux是c写的。
		公共函数库：ISO-C，在各种系统下都能运行。标准库函数遵循C标准规范（ISO-C）。		
				   POSIX-C，在类Unix下有效的C语言标准。

		应用程序--->shell和公共函数库--->系统调用--->内核

		目录相关的系统调用函数：
			chmod()：改变权限函数。
					int chmod（const char *file，_mode_）;
			chdir():切换当前工作目录。
					int chdir(const char *filepath);
					程序的起始时候的工作目录：你当时在哪。
					chdir切换了，工作目录，会影响相对路径的起始点。
			getcwd():获取当前工作目录的绝对路径。
					char *getcwd（char *buf,size_t size）
			mkdir():创建目录。
					int mkdir(const char *path,_mode_ mode);
			rmdir():删除空目录。只能删除空目录。
					int rmdir(const char *path);

day23------------------------------------------------------------------------------------------------------------------------------------------------------------
系统调用：内核对外暴露信息的一种方式。
		  Linux的内核是C语言写的。

ISO-C：	任何C语言平台都会遵守的规则。windows，Linux，Mac。
		函数的定义方式。
POSIX-C：类unix平台下，有约束力的c函数。Linux，Mac

ISO-C		POSX-C		系统调用
如果一个功能，三者都有，怎么选？
优先选择ISO-C，次选POSX-C，系统调用只能约束Linux内核。

入参的规律：对于指针，加const和不加 ，有本质的区别。
test（const chat *p）		只能读，不能写。
test（char *p）			可读可写。

返回值的规律：
		一个是正常的返回值。一个是错误的返回值（-1，NULL）。
		一般情况下，先检查返回值是不是-1/NULL。打印perror。

类型别名，结构体，怎么查具体的类型/里面的字段。
mode_t	off_t	pid_t	uid_t
首先，先生成.i文件。
	gcc -E test1.c -o test.i
再搜索：
	grep -nE "off_t"	test1.i

流：
	文件流：打开一个管子，不断地读取管子中的内容（文件的数据）。1：打开文件流。	2：检查是否打开成功。		3：使用。	4：关闭文件流。
	目录流：1:打开目录流。	2：检查返回值。	3：使用目录流。	4：关闭目录流。
			1：打开目录流。
				DIR *dir=opendir("test123");
			2：检查返回值。
				ERROR_

用echo输入的时候，实际上会在后面输入一个\n。例如：echo “123abc”>1.txt，实际输入，123abc\n
		目录流相关的函数：
			




		stat：是一个获取详细信息的系统调用（内核调用）（函数）。
			

			
		可以通过位运算来获取权限。
day24------------------------------------------------------------------------------------------------------------------------------------------------------------
		有缓冲：在用户空间，有一块内存（缓冲区）

		在内核空间，也有缓冲区，
		文件条幅数组

		flags是用二进制的某一位为1表示不同的含义。组合的时候，使用|组合的。
		如果要创建，一定要加权限。

		read不会做任何额外的填充，他只会读取数据，放到数组中。是靠返回值来确定读到了多少数据。

		printf("hello world !.\n");
		\n：printf是行缓存。
		也就是printf也有一个缓冲区。缓冲区是一个在用户空间的一块内存。
		printf遇到\n的时候，把在用户空间缓冲区缓存，传到内核区域。再显示在屏幕上。
		只要和硬件打交道，一定离不离开内核。
		
		文件描述符的0，1，2分别是标准输入，标准输出，标准错误。
		这三个文件描述符直接在程序启动的时候，就被系统直接占用了。

		printf是行缓冲区。
		文件流是满缓冲区。
		缓冲区各自是各自的，不是只有一个缓冲区。

		fwrite是满缓冲区，遇到\n也不把缓存放到内核缓冲区。

mmap：
		void *mmap(void *addr,size_t length,int prot,int flags,int fd,off_t offset);


		fflush：强制将在用户态的内存程序，写入内核态的缓存。

day24------------------------------------------------------------------------------------------------------------------------------------------------------------
管道：
		阻塞队列：是一个大小有限的队列。
				读空阻塞，写满阻塞。
		必须同时打开读端和写端才能继续。
		echo，打开写端。cat，打开读端。
		不能用vim打开管道文件。
		管道是在内核缓冲区存储的。管道的数据，从始至终都是在内核缓冲区中的。

IO多路复用概述。
		select就是用于监听文件描述符，是否可用。
		read（0，，，），read 0其实就是在监听0这个文件描述符。
		0 这个文件描述符，和标准输入对应，标准输入有内容，read就不会阻塞。

		fd_set是一个比特数组，她的每一个比特位都代表了文件描述符是否存在。
		比特位置1，表示我关心这个fd，
		比特位置0，表示我不关心这个fd。
		最多可以放1024个文件描述符。

day25------------------------------------------------------------------------------------------------------------------------------------------------------------
		fopen是一个ISO-C。	fopen在Linux中，使用到了open，在这个过程中，也使用了文件描述符。
		open是一个系统调用。

		每一个程序启动的时候，都会自带三个流。stdin,stdout,stderr	，他们三个是FILE *。底层分别使用了0，1，2。他们有三个宏，STDIN_FILENO，STDOUT_FILENO，STDERR_FILENO。
		另外还有一个fileno()，可以查看FILE *的文件标识符。

进程基础：
		进程状态：运行态。就绪态，等待态。
		
		在程序内部，可以获取程序自己的pid，ppid。
		getpid，getppid。

		创建进程：	
				system函数：是一个ISC-O函数，可以执行shell能执行的命令。		system("命令。。。");
				fork函数：是一个POSIX函数。创建一个新的进程，新的进程和老的进程，执行一摸一样的代码。
						fork的返回值：
							在父进程中，ret的值是正数，是子进程的pid。
							在子进程中，ret的值是0。
					fork是用于创建一个进程，进程的内存是隔离开，相互不影响。
					shell进程只等代码的父进程。

					fork的本质：复制一份完整的PCB（task_struct）档案，把档案里面的个人信息该以下（例如，新PID，之类的，专属的信息。）。
				exec族函数：
		退出程序：
				exit族函数：
				信号退出：
day26------------------------------------------------------------------------------------------------------------------------------------------------------------
		两种特殊的进程：
				孤儿进程：
				僵尸进程：
					wait是一个阻塞函数，他的阻塞结束条件，是等来一个子进程。
					waitpid
守护进程：
		

进程间的通信：
		pipe函数，用于创建一个管子。调一次pipe，创建一个管子。
		并且，会同步打开读写。将读写的文件描述符，传递给你。数组其实就是一个传入传出参数。
		pipe函数创建的匿名管道，只能用于	父子之间的进程通信。




int main(int argc, char *argv[])
{
	ARGS_CHECK(argc, 2);

	DIR *dirp=opendir(argv[1]);

	error_check

	struct dirent *dirent_p=readdir(dirp);
	//不用释放这个结构体。系统自动释放。

	dirent结构体：inode ，name ，


}








































*/

























